const WidgetLevel = [
	{
		period: 'hour',
		chartData: [
			[
				54.89021416992447,
				140.82283622620517
			],
			[
				63.51259015113515,
				111.94314984569402
			],
			[
				64.22169027665797,
				142.81739104509063
			],
			[
				66.98001120089471,
				176.13901167830406
			],
			[
				66.81127540371634,
				135.2089183830218
			],
			[
				56.26615990496148,
				165.25903544728652
			],
			[
				51.320969080071,
				121.99674481875553
			]
		]
	},
	{
		period: 'day',
		chartData: [
			[
				51.95156208315906,
				138.04287355181424
			],
			[
				63.21782064686491,
				122.60137828366456
			],
			[
				58.88430731973189,
				126.6154352609368
			],
			[
				52.961704759311004,
				111.28615149580077
			],
			[
				59.79163286943676,
				173.78753041432327
			],
			[
				59.82983576758468,
				106.13475197429268
			],
			[
				57.964074723442735,
				149.25904435150795
			],
			[
				62.52403114070169,
				175.84621952543054
			],
			[
				69.45092112146824,
				169.71009632719077
			],
			[
				64.90262183313119,
				144.45990921495977
			],
			[
				52.04381515281555,
				145.1397685667876
			],
			[
				67.87486175786762,
				153.06503508961808
			],
			[
				52.149222655259074,
				118.34112690976959
			],
			[
				51.358936343611965,
				176.72885243437548
			]
		]
	},
	{
		period: 'week',
		chartData: [
			[
				53.34959899079594,
				165.4440023827342
			],
			[
				63.2063277542905,
				161.53888505953103
			],
			[
				58.69726434001529,
				147.9610486279608
			],
			[
				50.50976027487944,
				163.70307550996475
			],
			[
				62.40428039178199,
				106.49097771679182
			],
			[
				52.63830343548487,
				150.1134464934343
			],
			[
				63.39535518349391,
				117.64184340625738
			],
			[
				63.71326265001542,
				157.66702975581146
			],
			[
				68.78271075578974,
				158.8093417536641
			],
			[
				68.3717128099198,
				152.85887876002596
			],
			[
				61.67390304825064,
				113.91720302370649
			],
			[
				54.79326849434257,
				126.20288575090254
			],
			[
				50.559681500766814,
				117.6958591841038
			],
			[
				64.6400488014225,
				127.37709284015904
			],
			[
				66.20931191151635,
				145.86404181087858
			],
			[
				67.27371101179578,
				123.50598812675005
			],
			[
				51.16712002838628,
				162.09447687481585
			],
			[
				65.0305891534726,
				159.76456108567155
			],
			[
				57.0992621650156,
				119.93637849380892
			],
			[
				50.96131108695586,
				126.52832555545032
			],
			[
				62.16959417427519,
				156.0236746657065
			],
			[
				68.11216544184686,
				149.96896342710772
			],
			[
				69.32207990930391,
				114.6214060770076
			],
			[
				61.87703908103448,
				158.3565271600304
			],
			[
				58.98641188190223,
				176.64800700889538
			],
			[
				68.6240754179645,
				142.65849648786582
			],
			[
				52.084593346812,
				169.14366064044668
			],
			[
				65.99750806129327,
				109.09096453656888
			],
			[
				61.38374627236061,
				162.51219223670182
			],
			[
				61.731450061375014,
				135.03108606243435
			],
			[
				53.99823628357923,
				124.51577727471184
			],
			[
				65.98123714168699,
				126.12099091085472
			],
			[
				66.47354911930603,
				161.84563298798514
			],
			[
				61.49520765076676,
				110.1717949848312
			],
			[
				53.55636507055322,
				159.77715077307892
			]
		]
	},
	{
		period: 'month',
		chartData: [
			[
				53.45394192634233,
				150.52631705808986
			],
			[
				65.36700320733021,
				138.60698887068799
			],
			[
				68.47260317255987,
				166.1764205868056
			],
			[
				60.8129161516666,
				106.89365021187031
			],
			[
				69.46185922115652,
				102.01704752838388
			],
			[
				61.58080439758578,
				133.89149108825984
			],
			[
				55.62766480292137,
				169.9632884639691
			],
			[
				51.186081494448004,
				137.57628303164248
			],
			[
				68.1813898381997,
				124.69412557897371
			],
			[
				55.3204321644909,
				176.68983754089723
			],
			[
				63.315704072391256,
				134.73049876991345
			],
			[
				62.45078389367552,
				128.61208565565215
			],
			[
				56.33188146845235,
				154.59728627781985
			],
			[
				65.12493643581155,
				151.67292699824154
			],
			[
				67.19714570852612,
				165.26292847225187
			],
			[
				51.726513171627346,
				156.83648769425733
			],
			[
				50.50658623602714,
				170.87681695530884
			],
			[
				56.647638640803244,
				100.21745749246135
			],
			[
				50.5689652534793,
				107.82527580688591
			],
			[
				53.845022170058556,
				137.6424104346513
			],
			[
				63.27568981163104,
				168.01188898770476
			],
			[
				67.74511476954069,
				116.67331901238023
			],
			[
				61.5234071658687,
				115.4489021473089
			],
			[
				64.99707488568268,
				133.52315559927158
			],
			[
				67.19276202731393,
				155.4343984613741
			],
			[
				60.10694005290661,
				146.8103292853539
			],
			[
				69.291435829396,
				131.82090628395878
			],
			[
				54.73416956165606,
				130.86406077456726
			],
			[
				59.56236872535066,
				156.12550221891533
			],
			[
				59.15803126439633,
				151.9278549553506
			]
		]
	}
];

export const WidgetStatistic = [
		{
			season: '2020-2021',
			games:0,
			goals:0,
			skipped:0,
			repulsed:6
		},
		{
			season: '2021-2022',
			games:1,
			goals:41,
			skipped:1,
			repulsed:6
		},
		{
			season: '2020-2021',
			games:4,
			goals:4,
			skipped:4,
			repulsed:6
		},
		{
			season: '2020-2021',
			games:4,
			goals:4,
			skipped:4,
			repulsed:6
		}
];


// Данные для виджета Аналитика
const WidgetStatisticAnalytics = [
	{
		season: '2020-2021',
		games:0,
		goals:0,
		skipped:0,
		repulsed:6
	},
	{
		season: '2020-2021',
		games:1,
		goals:1,
		skipped:1,
		repulsed:1
	},
];

const WidgetStatisticGame = [

];

const WidgetMapsGoal = [

];

const WidgetMapsGoalZone = [

];

const WidgetStatisticMatch = [

];

const WidgetStatisticTotal = [

];

const IndicationStatistic = [

];

// Виджеты для холодильника
export const WidgetAll = [
	{
		widgetComponent: 'WidgetStatisticAnalytics',
		widgetTitle: 'Аналитика',
		widgetDate: WidgetStatisticAnalytics
	},
	{
		widgetComponent: 'WidgetLevel',
		widgetTitle: 'Уровень нагрузки',
		widgetDate: WidgetLevel
	},
];

// Страница Общая спортсмена
export const WidgetList = [
	{
		widgetComponent: 'WidgetStatisticAnalytics',
		widgetPosition: 1,
		widgetCol: 6,
		widgetTitle: 'Аналитика1111',
		widgetData: WidgetStatisticAnalytics
	},
	{
		widgetComponent: 'WidgetLevel',
		widgetPosition: 2,
		widgetCol: 6,
		widgetTitle: 'Уровень нагрузки',
		widgetData: WidgetLevel
	},
	{
		widgetComponent: 'WidgetStatistic',
		widgetPosition: 3,
		widgetCol: 6,
		widgetTitle: 'Статистика сезона 2020-2021',
		widgetData: WidgetStatistic
	},
];

// Страница Статистика спортсмена
export const WidgetListStat = [
	{
		widgetComponent: 'WidgetStatisticGame',
		widgetPosition: 1,
		widgetCol: 12,
		widgetTitle: 'Статистика сезона 2020-2021',
		widgetData: WidgetStatisticGame
	},
	{
		widgetComponent: 'IndicationStatistic',
		widgetPosition: 2,
		widgetCol: 12,
		widgetTitle: 'Показатели',
		widgetData: IndicationStatistic
	},
	{
		widgetComponent: 'WidgetMapsGoal',
		widgetPosition: 3,
		widgetCol: 6,
		widgetTitle: 'Карта бросков и голов',
		widgetData: WidgetMapsGoal
	},
	{
		widgetComponent: 'WidgetMapsGoalZone',
		widgetPosition: 4,
		widgetCol: 6,
		widgetTitle: 'Броски в створ по зонам',
		widgetData: WidgetMapsGoalZone
	},
	{
		widgetComponent: 'WidgetStatisticMatch',
		widgetPosition: 5,
		widgetCol: 12,
		widgetTitle: 'Матчи',
		widgetData: WidgetStatisticMatch
	},
	{
		widgetComponent: 'WidgetStatisticTotal',
		widgetPosition: 6,
		widgetCol: 12,
		widgetTitle: 'Общая статистика',
		widgetData: WidgetStatisticTotal
	},
	{
		widgetComponent: 'WidgetStatisticAnalytics',
		widgetPosition: 7,
		widgetCol: 12,
		widgetTitle: 'Аналитика',
		widgetData: WidgetStatisticAnalytics
	},
];